Articles/Math/euler-method/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Euler Method</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta http-equiv="X-UA-Compatible" content="ie=edge">
<title>Blah</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer">
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.10.0/dist/katex.min.css" integrity="sha384-9eLZqc9ds8eNjO3TmqPeYcDj8n+Qfa4nuSiGYa6DjLNcv9BtN69ZIulL9+8CqC9Y" crossorigin="anonymous"/>
</head>
<body>
<div id="preamble" class="status">
<header> <a href="https://ianstranathan.github.io/">Main</a> :: <a href="https://ianstranathan.github.io/Articles/">Articles</a> ::</header></header>
</div>
<div id="content" class="content">
<h1 class="title">Euler Method</h1>
<p>
<i>Derivation of forward euler method for a [[..</i>../../projects/JS<sub>and</sub><sub>WebGL</sub>/collision<sub>study</sub>/refactor][small project]]/
</p>

<div id="outline-container-org155ab2f" class="outline-2">
<h2 id="org155ab2f">Derivation</h2>
<div class="outline-text-2" id="text-org155ab2f">
<hr />

<p>
Numerically integrating an ordinary differential equation of motion of a particle using the Euler method:
</p>

<p>
The limit representation of a derivative:
</p>

<p>
\[ {f(x)}^\prime = \lim_{h \to 0} \frac {f(x + h) - f(x)}{h}\]
</p>

<p>
Where \(h\) is some infinitesimal change in a continuous variable. 
</p>

<p>
For an equation of motion in a simulation, \(h\) is time \(t\),
the discrete physics time step or change in time for a physics cycle.
</p>

<p>
\[ {f(t)}^\prime \approx \frac {f(t + {\Delta t}) - f(t)}{\Delta t}\]
</p>

<p>
Algebraically rearranging for the function at the next time step \(f(x + {\Delta t})\):
</p>

<p>
\[ f(t + {\Delta t}) \approx {f(t)}^\prime {\Delta t}  + f(t)  \]
</p>

<p>
That is to say, we can approximate the value of the next step of a function 
if we have its value and the value of its derivative
at the current time step.
</p>

<p>
We can apply this in a simnple simulation after resolving the acceleration of a cycle by working backward.
</p>

<p>
In general, for position \(\vec r\):
</p>

<p>
\[\vec v = \frac{d}{dt} \vec r\]
\[\vec a = \frac{d}{dt} \vec v\]
\[\implies v(t + \Delta t) \approx {v(t)}^\prime {\Delta t}  + v(t)\]
</p>

<p>
\[v(t + \Delta t) \approx a(t) {\Delta t}  + v(t)\]
</p>

<p>
similarly:
\[r(t + \Delta t) \approx {r(t)}^\prime {\Delta t}  + r(t)\]
\[r(t + \Delta t) \approx v(t) {\Delta t}  + r(t)\]
</p>


<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #989898;">// </span><span style="color: #989898;">After resolving acceleration</span>

rigidBody.velocity += acceleration;
rigidBody.position += velocity;

</pre>
</div>
<hr />

<p>
Note:
The same result can be found by using a Taylor expansion around the next time step and truncating second order and higher terms.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer><p>©Ian Stranathan <script>document.write(new Date().getFullYear())</script></p></footer>
</div>
</body>
</html>